// •	Какое будет выведено значение: let x = 5; alert( x++ ); ?

let x = 5;
alert(x++); // будет 5, чтобы получилось 6 нужно (++x)
console.log(x);


// •	Чему равно такое выражение: [ ] + false - null + true ?

console.log(typeof ([] + false - null + true)); // false '' + false = false //NaN


// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?

let y = 1;
let z = y = 2;
alert(z); // 2


// •	Чему равна сумма [ ] + 1 + 2?

console.log([] + 1 + 2); //12


// •	Что выведет этот код: alert( "1"[0] )?

alert("1" [0]); //1 Индекс[0] = 1


// •	Чему равно 2 && 1 && null && 0 && undefined ?

null; // && (и) запинается на лжи, а || (или) запинается на правде

// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)?

console.log(!!(a && b) === (a && b)); // !! превращает код в boolean


// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ?

alert(null || 2 && 3 || 4); // && (и) возвращает последнее значение, в этом приемере это 3

// •	c = [1, 2, 3]; v = [1, 2, 3]; Правда ли что c == v ?

const c = [1, 2, 3];
const v = [1, 2, 3];

// c не равно v, потому что это разные массивы с похожими данными


// •	Что выведет этот код: alert( +"Infinity" ); ?

//выведет Infinity в числовом типе данных из-за +

// •	Верно ли сравнение: "Ёжик" > "яблоко"?

// •	Чему равно 0 || "" || 2 || undefined || true || falsе ?

console.log('ఋ' > 'd');